// Найти сумму чисел от 1 до А
Console.WriteLine("Введите число n: ");
int n = int.Parse(Console.ReadLine()?? "0);
int sum = n*(n+1)/2;
Console.WriteLine(sum);